Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The other axis can be constrained independently.
zh_cn: 另一个轴可以独立约束。

source: The other functions will leave it as-is and no density will be applied.
zh_cn: 其他功能将保持原样并且不会应用密度。

source: The other set of position related methods are in the form of *AdapterPosition*.
zh_cn: 另一个与位置相关的方法是 *AdapterPosition* 的形式。

source: The output will always be high quality.
zh_cn: 输出将始终是高质量的。

source: The overridden onMeasure() method is called with width and height measure specifications (widthMeasureSpec and heightMeasureSpec parameters, both are integer codes representing dimensions) which should be treated as requirements for the restrictions on the width and height measurements you should produce.
zh_cn: 重写的 onMeasure() 方法调用时会传递宽高的测量规格。(widthMeasureSpec 和 heightMeasureSpec 参数，两者都是整型表示的尺寸)，宽高的测量规格应该被视为你计算的宽高测量结果的限制。

source: The packaging tool extracts this XML content, compiles it to binary form, and archives the content.
zh_cn: 打包工具提取此 XML 内容，将其编译为二进制形式，并归档内容。

source: The padding is expressed in pixels for the left, top, right and bottom parts of the view.
zh_cn: padding 以像素为位表示了 view 的 left, top, right 和 bottom 四部分的 padding。

source: The parameter to onDraw() is a Canvas object that the view can use to draw itself.
zh_cn: onDraw() 的参数是一个 Canvas 对象，view 可用于绘制自身。

source: The parent may optionally consume the fling or observe a child fling.
zh_cn: parent 可以选择消耗 fling 或观察 child fling。

source: The payloads parameter is a merge list from #notifyItemChanged(int, Object) or #notifyItemRangeChanged(int, int, Object).
zh_cn: payloads (有效荷载) 参数是来自 #notifyItemChanged(int, Object) 或 #notifyItemRangeChanged(int, int, Object) 的合并列表。

source: The permission remains in effect until you revoke it by calling revokeUriPermission() or until the device reboots.
zh_cn: 直到你通过调用 revokeUriPermission() 来取消，或直到设备重新启动为止，权限都会生效。

source: The permissions you provide become available to any app, and remain in effect until you change them.
zh_cn: 你提供的权限可用于 any 应用程序，并保持有效，直到你更改它们。

source: The pink rectangle in the bottom image identifies the region in which the contents of the View are allowed.
zh_cn: 下方的图中紫色矩形标明了 View 的内容允许的区域。

source: The pixel density of the actual screen that is being used.
zh_cn: 正在使用的实际屏幕的像素密度。

source: The pixel density of the destination this bitmap will be drawn to.
zh_cn: 该位图将被绘制到的目标的像素密度。

source: The pixel density to use for the bitmap.
zh_cn: 用于位图的像素密度。

source: The point of having style guidelines is to have a common vocabulary of coding, so people can concentrate on what you're saying, rather than on how you're saying it.
zh_cn: 制定样式规范的目的是整理出通用的编码词汇表，以便人们可以专注于你所说的内容，而不是你表达的方式。

source: The position of buffer will not be affected.
zh_cn: buffer 的位置不会受到影响。

source: The position of a data item within an Adapter.
zh_cn: 数据项在 Adapter 中的位置。

source: The position of the item within the adapter's data set.
zh_cn: 项在适配器数据集中的位置。

source: The possible values are:
zh_cn: 可能的值有：

source: The preferred way to perform the inflation of the layout resource is the following:
zh_cn: 执行布局资源加载的首选方法如下：

source: The presence of this character sequence must generate a fatal error during serialization or the cdata section must be splitted before the serialization (see also the parameter "split-cdata-sections" in the DOMConfiguration interface).
zh_cn: 在序列化期间，此字符序列的存在必须生成致命错误，或者必须在序列化之前拆分 cdata 部分(另请参阅 DOMConfiguration 接口)。

source: The process and the activity need to be restarted, but the task can benefit somewhat from the saved instance state bundle passed into onCreate().
zh_cn: 需要重新启动进程和 activity，但是任务可以从传递到 onCreate() 的已保存实例状态包中获益。

source: The process may have continued to run, but the app must recreate the activity from scratch via a call to onCreate().
zh_cn: 该过程可能已继续运行，但应用程序必须通过调用 onCreate() 从头开始重新创建 activity。

source: The process of preparing a child view to display data corresponding to a position within the adapter.
zh_cn: 准备一个 view（用于显示 adapter 中相应 position 的数据）的过程。 。

source: The prompt to display when the spinner's dialog is shown.
zh_cn: 显示微调器对话框时显示的提示。

source: The properties and methods can also be used in conjunction with Animator-based animations, described more in the Animation section.
zh_cn: 这些属性和方法也可以与基于 Animator 的动画结合使用，详见 Animation 。

source: The provided Bitmap's width, height, and Bitmap.Config will not be changed.
zh_cn: 提供的位图的宽度，高度和 Bitmap.Config 将不会更改。

source: The radius of the circle for this gradient
zh_cn: 此渐变的圆的半径

source: The radius of the circle for this gradient.
zh_cn: 此渐变的圆的半径。

source: The range of dates supported by this calendar is configurable.
zh_cn: 此日历支持的日期范围是可配置的。

source: The rare exception to this rule is test code and top-level code where you want to catch all kinds of errors (to prevent them from showing up in a UI, or to keep a batch job running).
zh_cn: 这条规则的特例是：在测试代码和顶级代码中，你希望捕获所有类型的错误(以防它们显示在界面中或者以便一直进行批处理作业)。

source: The rating to set by default.
zh_cn: 默认设置的评级。

source: The ratio between two connections when the left and right (or start and end) sides are constrained.
zh_cn: 当左边和右边(或 start 和 end)被约束时，两个连接之间的比例。

source: The ratio between two connections when the top and bottom sides are constrained.
zh_cn: 当顶部和底部被约束时，两个连接之间的比率。

source: The ratio can be expressed either as:
zh_cn: 该比例可以表示为：

source: The ratio information.
zh_cn: 比例信息。

source: The ratio of dp-to-pixel will change with the screen density, but not necessarily in direct proportion.
zh_cn: dp 与像素的比率将随着屏幕密度而变化，但不一定是成正比的。

source: The ratio of the distance to the parent's sides
zh_cn: 距离 parent 的边的距离的比例。

source: The real work is done in decodeDrawable or decodeBitmap.
zh_cn: 实际工作在 decodeDrawable 或 decodeBitmap 中完成。

source: The region can be modified via theregion method and queried via the regionStart and regionEnd methods.
zh_cn: 可通过 region 方法修改区域，通过 regionStart 和 regionEnd 方法查询区域。

source: The relative position of each corresponding color in the colors array, beginning with 0 and ending with 1.0.
zh_cn: 颜色数组中每个对应颜色的相对位置，从 0 开始到 1.0 结束。

source: The relative position of each corresponding color in the colors array.
zh_cn: 颜色数组中每个对应颜色的相对位置。

source: The relative positions [0..1] of each corresponding color in the colors array.
zh_cn: 颜色数组中每个对应颜色的相对位置[0..1]。

source: The reported log line looks similar to the following example:
zh_cn: 报告的日志行类似于以下示例：

source: The result (or output) alpha value is noted αout
zh_cn: 结果（或输出）的 alpha 值标记为 αout

source: The result (or output) color value is noted Cout
zh_cn: 结果（或输出）的颜色值标记为 Cout

source: The result is centered inside dst.
zh_cn: 结果在 dst 内的中间。

source: The result of a match operation.
zh_cn: 匹配操作的结果。

source: The resulting height of the bitmap.
zh_cn: 位图的结果高度。

source: The resulting width of the bitmap.
zh_cn: 位图的结果宽度。

source: The returned object will be a String if this is a plain string; it will be some other type of CharSequence if it is styled.
zh_cn: 如果这是一个普通的字符串，返回的对象将是一个 String;如果它有样式，它将是一些其他类型的 CharSequence。

source: The right bound for a child's indicator.
zh_cn: 子项指示器的右边限。

source: The right bound for an item's indicator.
zh_cn: 项目指示器的右边界。

source: The right margin to use when the target is gone
zh_cn: 当目标 gone 时使用的右边 margin。

source: The right side of a view in right to left languages.
zh_cn: 在从左到右语言中，是 view 的右边。（译注：这里原文应该不正确）。

source: The right side of a view.
zh_cn: view 的右边。

source: The root path of this subdirectory is the same as the value returned by getCacheDir().
zh_cn: 此子目录的根路径与 getCacheDir() 返回的值相同。

source: The root path of this subdirectory is the same that Environment.getExternalStorageDirectory() returns.
zh_cn: 此子目录的根路径与 Environment.getExternalStorageDirectory() 返回的路径相同。

source: The rules used by this widget to decide how to format the date and time are the following:
zh_cn: 此窗口小部件用于决定如何格式化日期和时间的规则如下：

source: The sample size is the number of pixels in either dimension that correspond to a single pixel in the decoded bitmap.
zh_cn: 样本大小是任一维度中与解码位图中的单个像素对应的像素数量。

source: The scroll will use the default value of 250 milliseconds for the duration.
zh_cn: 滚动将使用默认值 250 毫秒的持续时间。

source: The scrollbar style to display the scrollbars at the edge of the view, increasing the padding of the view.
zh_cn: 滚动条样式，用于在 view 边缘显示滚动条，增加 view 的填充。

source: The scrollbar style to display the scrollbars at the edge of the view, without increasing the padding.
zh_cn: 滚动条样式可在 view 边缘显示滚动条，而不会增加填充。

source: The scrollbar style to display the scrollbars inside the content area, without increasing the padding.
zh_cn: 滚动条样式显示内容区域内的滚动条，不增加填充。

source: The scrollbar style to display the scrollbars inside the padded area, increasing the padding of the view.
zh_cn: 滚动条样式显示填充区域内的滚动条，增加 view 的填充。

source: The second form should parse and apply any attributes defined in the layout file.
zh_cn: 第二种形式应该解析并应用所有在布局文件中定义的属性。

source: The second pair is simply known as width and height, or sometimes drawing width and drawing height.
zh_cn: 第二对简称为 width 和 height，或者有时 drawing width (绘制宽度) 和 drawing height (绘制高度)。

source: The second pass happens in layout(int, int, int, int) and is also top-down.
zh_cn: 第二个过程发生在 layout(int, int, int, int)，它也是自顶向下的。

source: The secondary progress should not be modified by the client as it is used internally as the background for a fractionally filled star.
zh_cn: 客户端不应修改次要进度，因为它在内部用作分数填充星的背景。

source: The sections below explain how to create custom Views and use them in your application.
zh_cn: 下面的章节将介绍如何创建自定义的 View 并在应用中使用它们。

source: The selected option is displayed above the dropdown.
zh_cn: 所选选项显示在下拉列表上方。

source: The selection is identified by the unique id of the radio button as defined in the XML layout file.
zh_cn: 选择由 XML 布局文件中定义的单选按钮的唯一 ID 标识。

source: The set of spinners and the calendar view are automatically synchronized.
zh_cn: 旋转器组和日历 view 自动同步。

source: The size can be controlled with the fabSize attribute.
zh_cn: 可以使用 fabSize 属性控制大小。

source: The size of a view is expressed with a width and a height.
zh_cn: view 的尺寸表示为宽度和高度。

source: The size of the FrameLayout is the size of its largest child (plus padding), visible or not (if the FrameLayout's parent permits).
zh_cn: FrameLayout 的大小是其最大子项(加上 padding)的大小，可见或不可见(如果 FrameLayout 的父级允许)。

source: The size of the SlidingDrawer defines how much space the content will occupy once slid out so SlidingDrawer should usually use match_parent for both its dimensions.
zh_cn: SlidingDrawer 的大小定义了内容在滑出后占用的空间大小，因此 SlidingDrawer 通常应该对其两个尺寸使用 match_parent。

source: The size of your APK has an impact on how fast your app loads, how much memory it uses, and how much power it consumes.
zh_cn: APK 的大小会影响你的应用加载速度，使用的内存量以及消耗的功率。

source: The smaller RatingBar style ( R.attr.ratingBarStyleSmall) and the larger indicator-only style (R.attr.ratingBarStyleIndicator) do not support user interaction and should only be used as indicators.
zh_cn: 较小的 RatingBar 样式(R.attr.ratingBarStyleSmall)和较大的仅指示器样式(R.attr.ratingBarStyleIndicator)不支持用户交互，只应用作指标。

source: The source pixels are discarded, leaving the destination intact.
zh_cn: 源像素被丢弃，保持目标像素不变。

source: The source pixels are drawn behind the destination pixels.
zh_cn: 源像素绘制在目标像素后面。

source: The source pixels are drawn over the destination pixels.
zh_cn: 源像素绘制在目标像素上。

source: The source pixels replace the destination pixels.
zh_cn: 源像素替换目标像素。

source: The specified color space's transfer function must be an ICC parametric curve.
zh_cn: 指定的颜色空间的传递函数必须是 ICC parametric curve。

source: The specified view will be added to a pool of views for later rebinding and reuse.
zh_cn: 指定的 view 将被添加到 view 池中，以便以后重新绑定和重用。

source: The stable layout your UI sees is based on the system UI modes you can switch to.
zh_cn: UI 看到的稳定布局基于你可以切换到的系统 UI 模式。

source: The start bound for a child's indicator.
zh_cn: 子项指示器的开始边限。

source: The start bound for an item's indicator.
zh_cn: 项目指示器的起始界限。

source: The start margin to use when the target is gone.
zh_cn: 当目标 gone 时使用的 start margin。

source: The state set here will be removed by the system in various situations (such as the user moving to another application) like the other system UI states.
zh_cn: 系统将在各种情况下(例如用户移动到另一个应用程序)移除此处设置的状态，就像其他系统 UI 状态一样。

source: The static function Create(Modes) can be called to return an instance of any of the predefined subclasses as specified in the Modes enum.
zh_cn: 可以调用静态函数 Create(Modes) 来返回 Modes 枚举中指定的任何预定义子类的实例。

source: The step size of the rating.
zh_cn: 评级的步长。

source: The stream's position will be where ever it was after the encoded data was read.
zh_cn: 流的位置将是读取编码数据后的位置。

source: The subdirectory name for this value is contained in the path attribute.
zh_cn: 该值的子目录名称包含在 path 属性中。

source: The subdirectory you're sharing.
zh_cn: 你正在分享的子目录。

source: The subtitle, if present should indicate any extended information about the current content.
zh_cn: 副标题(如果存在)应指示有关当前内容的任何扩展信息。

source: The super.onDraw() method is called before the method ends.
zh_cn: super.onDraw() 方法在方法结束前被调用。

source: The superclass method should be invoked, and in this case, we do it at the end after we have painted the lines we want to include.
zh_cn: 应该调用超类方法，在这种情况下，我们在绘制了要包含的行之后最后执行它。

source: The superclass method should be invoked, but in this case, we do it at the end after we have painted the lines we want to include.
zh_cn: 该父类方法应该被执行，但在这个例子中，我们在画完我们想包含的线以后的结尾处执行它。

source: The superclass methods to override start with 'on', for example, onDraw(), onMeasure(), and onKeyDown().
zh_cn: 父类要重写的方法以 'on' 开头，比如 onDraw()、onMeasure()、onKeyDown() 等等。

source: The surface is Z ordered so that it is behind the window holding its SurfaceView; the SurfaceView punches a hole in its window to allow its surface to be displayed.
zh_cn: surface 是 Z 有序的，因此它位于窗口后面，保持着 SurfaceView; SurfaceView 在其窗口中打孔以允许其 surface 显示。

source: The system evicts your app from memory, and then the user re-launches it.
zh_cn: 系统将你的应用程序从内存中逐出，然后用户重新启动它。

source: The system executes the code in onClick on the main thread.
zh_cn: 系统在 主线程 上执行 onClick 中的代码。

source: The table has as many columns as the row with the most cells.
zh_cn: 该表的列数与具有最多单元格的行数相同。

source: The text appearance for the day numbers in the calendar grid.
zh_cn: 日历网格中日期编号的文本外观。

source: The text appearance for the week day abbreviation in the calendar header.
zh_cn: 日历标题中的工作日缩写的文本外观。

source: The text color for the header's day of week.
zh_cn: 标题星期几的文本颜色。

source: The text color list of the calendar.
zh_cn: 日历的文本颜色列表。

source: The text for the button when it is checked.
zh_cn: 选中时按钮的文本。

source: The text for the button when it is not checked.
zh_cn: 未选中时按钮的文本。

source: The thickness of the divider can be changed by using the R.attr.selectionDividerHeight attribute and the color of the divider can be changed by using the R.attr.colorControlNormal attribute.
zh_cn: 可以使用 R.attr.selectionDividerHeight 属性更改分隔线的厚度，并可以使用 R.attr.colorControlNormal 属性更改分隔线的颜色。

source: The three RGB color channels and the alpha channel (translucency) are stored with a 4 bits precision (16 possible values.) This configuration is mostly useful if the application needs to store translucency information but also needs to save memory.
zh_cn: 三个 RGB 颜色通道和 alpha 通道(半透明)以 4 位精度(16 个可能值)存储。如果应用程序需要存储半透明信息，但也需要节省内存，此配置最为有用。

source: The timer can also count downward towards the base time by setting setCountDown(boolean) to true.
zh_cn: 通过 setCountDown(boolean) 设置为 true，计时器也可以向下计数到基准时间。

source: The tinting color for the image.
zh_cn: 图像的着色颜色。

source: The title appearance can be tweaked via the collapsedTextAppearance and expandedTextAppearance attributes.
zh_cn: 可以通过 collapsedTextAppearance 和 expandedTextAppearance 属性来调整标题外观。

source: The title associated with the item.
zh_cn: 与项目关联的标题。

source: The title from each page is supplied by the method PagerAdapter.getPageTitle(int) in the adapter supplied to the ViewPager.
zh_cn: 每个页面的标题由提供给 ViewPager 的适配器中的方法 PagerAdapter.getPageTitle(int) 提供。

source: The title this view should present to accessibility as a pane title.
zh_cn: 此 view 应作为窗格标题呈现给可访问性的标题。

source: The top margin to use when the target is gone.
zh_cn: 当目标 gone 时使用的顶部 margin。

source: The top of a view.
zh_cn: view 的顶边。

source: The top-level view of a list item can implement this interface to allow itself to modify the bounds of the selection shown for that item.
zh_cn: 列表项的顶级 view 可以实现此接口，以允许自己修改为该项显示的选择的边界。

source: The total width of the table is defined by its parent container.
zh_cn: 表的总宽度由其父容器定义。

source: The touch mode state is maintained across Activitys.
zh_cn: 触摸状态是跨 Activity 的。

source: The transitionName for the view background will be "android:status:background".
zh_cn: view 背景的 transitionName 将是 "android:status:background"。

source: The transparent region that makes the surface visible is based on the layout positions in the view hierarchy.
zh_cn: 使 surface 可见的透明区域基于 view 层次结构中的布局位置。

source: The tree is largely recorded and drawn in order, with parents drawn before (i.e., behind) their children, with siblings drawn in the order they appear in the tree.
zh_cn: 树大部分是按顺序记录和绘制的，父项在他们的子项之前(即后面)绘制，同级按照他们出现在树中的顺序绘制。

source: The type of the View, defined by adapter
zh_cn: view 的类型，由适配器定义

source: The unconsumed portion may be used to allow continuous dragging of multiple scrolling or draggable elements, such as scrolling a list within a vertical drawer where the drawer begins dragging once the edge of inner scrolling content is reached.
zh_cn: 未消耗部分可用于允许连续拖动多个滚动或可拖动元素，例如在垂直抽屉内滚动列表，其中一旦到达内部滚动内容的边缘，抽屉开始拖动。

source: The unit for location and dimensions is the pixel.
zh_cn: 位置和尺寸的单位是像素。

source: The unregistered observer will no longer receive events about changes to the adapter.
zh_cn: 注销的观察者将不再接收有关适配器更改的事件。

source: The use and location of static imports have been mildly controversial issues.
zh_cn: 静态导入的使用和位置一直都存在争议。

source: The use of application icon plus title as a standard layout is discouraged on API 21 devices and newer.
zh_cn: API 21 和更新的设备不鼓励使用应用程序图标加标题作为标准布局。

source: The user backs out of your app, but then re-launches it.
zh_cn: 用户退出你的应用，但随后重新启动它。

source: The user can touch the thumb and drag left or right to set the current progress level or use the arrow keys.
zh_cn: 用户可以触摸 thumb 并向左或向右拖动以设置当前进度级别或使用箭头键。

source: The user can touch/drag or use arrow keys to set the rating when using the default size RatingBar.
zh_cn: 使用默认大小 RatingBar 时，用户可以触摸/拖动或使用箭头键设置评级。

source: The user may drag the "thumb" back and forth to choose the selected option, or simply tap to toggle as if it were a checkbox.
zh_cn: 用户可以来回拖动“thumb”来选择所选的选项，或者只需点击以切换就像它是一个复选框一样。

source: The user will want to be able to scroll the list fully into view before the list itself begins scrolling.
zh_cn: 用户希望能够在列表本身开始滚动之前将列表完全滚动到 view 中。

source: The usual starting point is a Layout of some kind, so create a class that extends a Layout.
zh_cn: 通常需要从某种类型的的 Layout 开始，所以创建一个继承 Layout 的类。

source: The value always begins with a pound (#) character and then followed by the Alpha-Red-Green-Blue information in one of the following formats:
zh_cn: 值始终以井号(#)开头，然后是以下列格式之一的 Alpha-Red-Green-Blue 信息：

source: The value is changed by flinging vertically.
zh_cn: 通过垂直投掷来更改该值。

source: The value you set affects both horizontal and vertical alignment of all child views within the single row or column.
zh_cn: 你设置的值会影响单个行或列中所有子 view 的水平和垂直对齐方式。

source: The values are unpremultiplied, meaning any transparency is stored solely in the alpha component, and not in the color components.
zh_cn: 这些值没有预乘，这意味着任何透明度都仅存储在 alpha 组件中，而不是存储在颜色组件中。

source: The values corresponding to indices in ascending order are guaranteed to be associated with keys in ascending order, e.g., valueAt(0) will return the value associated with the smallest key and valueAt(size()-1) will return the value associated with the largest key.
zh_cn: 升序索引对应的值保证与升序键关联，例如，valueAt(0) 将返回与最小键关联的值，valueAt(size()-1) 将返回与最大键关联的值。

source: The vertical bias attribute of the child will then affect the positioning of the packed elements
zh_cn: child 的垂直偏心属性将会影响打包后的元素的定位。

source: The vertical orientation.
zh_cn: 垂直方向。

source: The view drawing cache was largely made obsolete with the introduction of hardware-accelerated rendering in API 11.
zh_cn: 随着 API 11 中硬件加速渲染的引入，view 绘制缓存在很大程度上已经过时。

source: The view handles the event and notifies any listeners.
zh_cn: 该 view 处理事件并通知任意的（译注：所有的）监听器。

source: The view hierarchy will take care of correctly compositing with the Surface any siblings of the SurfaceView that would normally appear on top of it.
zh_cn: view 层次结构将负责正确地与 Surface 合成任何通常出现在它上面的 SurfaceView 的兄弟。

source: The view inspector indicates which is set as a ratio by connecting the corresponding edges with a solid line.
zh_cn: 视图检查器通过用实线链接相应的边来指示设置为比率。

source: The view is important for accessibility.
zh_cn: 该 view 对于可访问性非常重要。

source: The view is important for autofill, and its children (if any) will be traversed.
zh_cn: 该 view 对于自动填充非常重要，并且将遍历其子项(如果有)。

source: The view is important for autofill, but its children (if any) will not be traversed.
zh_cn: 该 view 对于自动填充非常重要，但其子项(如果有)将不会被遍历。

source: The view is not important for accessibility, nor are any of its descendant views.
zh_cn: 该 view 对于可访问性并不重要，对其后代 view 也不重要。

source: The view is not important for accessibility.
zh_cn: 该 view 对可访问性并不重要。

source: The view is not important for autofill, and its children (if any) will not be traversed.
zh_cn: 该 view 对于自动填充并不重要，并且不会遍历其子项(如果有)。

source: The view is not important for autofill, but its children (if any) will be traversed.
zh_cn: 该 view 对于自动填充并不重要，但其子项(如果有)将被遍历。

source: The view type of the new View.
zh_cn: 新 View 的 view 类型。

source: The view will act as normal with no collapsing behavior.
zh_cn: view 将正常工作，没有折叠行为。

source: The view will be scroll in direct relation to scroll events.
zh_cn: view 将与滚动事件直接相关地滚动。

source: The view will pin in place until it reaches the bottom of the CollapsingToolbarLayout.
zh_cn: view 将固定位置，直到它到达 CollapsingToolbarLayout 的底部。

source: The view will scroll in a parallax fashion.
zh_cn: view 将以视差方式滚动。

source: The view with this id must be a descendant of the CoordinatorLayout containing the child view this LayoutParams belongs to.
zh_cn: 具有此 id 的 view 必须是包含此 LayoutParams 所属的子 view 的 CoordinatorLayout 的后代。

source: The views added to an ImageSwitcher must all be ImageView.
zh_cn: 添加到 ImageSwitcher 的 view 必须都是 ImageView。

source: The visibility of the group will be applied to the referenced widgets.
zh_cn: 组的可见性将应用于引用的小部件。

source: The way that the region boundaries interact with some pattern constructs can be changed.
zh_cn: 区域边界与某些模式构造交互的方式是可以更改的。

source: The way to use this class is to instantiate it programmatically.
zh_cn: 使用此类的方法是以编程方式实例化它。

source: The widget will display the correct default Material styles without the use of a style flag.
zh_cn: 小部件将显示正确的默认材质样式，而不使用样式标志。

source: The widget will display the correct default Material styles without the use of the style flag.
zh_cn: 小部件将显示正确的默认材质样式，而不使用样式标志。

source: The width and height can be obtained by calling getWidth() and getHeight().
zh_cn: 这对宽高可以通过调用 getWidth() 和 getHeight() 获取。

source: The width of a column is defined by the row with the widest cell in that column.
zh_cn: 列的宽度由该列中具有最宽单元格的行定义。

source: The window will disappear if left idle for three seconds and reappear when the user touches the anchor view.
zh_cn: 如果闲置三秒钟，窗口将消失，当用户触摸锚 view 时，窗口将重新出现。

source: The zero-based index of the columns to collapse.
zh_cn: 要折叠的列的从零开始的索引。

source: The zero-based index of the columns to shrink.
zh_cn: 要收缩的列的从零开始的索引。

source: The zero-based index of the columns to stretch.
zh_cn: 要拉伸的列的从零开始的索引。

source: Their primary purpose is for including material such as XML fragments, without needing to escape all the delimiters.
zh_cn: 它们的主要目的是包含诸如 XML 片段之类的材料，而无需转义所有分隔符。

source: Themed launch screens
zh_cn: 启动屏幕主题

source: Themes
zh_cn: 主题

source: Then Gradle removes the unused resources.
zh_cn: 然后 Gradle 移除未使用的资源。

source: Then click the text baseline and drag the line to another baseline.
zh_cn: 然后点击本文基线并将该线拖动到另外一个基线。
